EDT/УТ/src/DataProcessors/МониторингЗаказов/МониторингЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МониторингЗаказов</name>
  <attributes>
    <name>ПериодАвтообновленияСписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницаМониторингаПоИнтервалуДоставкиЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМониторинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ДанныеМониторингаЗаказов/ДанныеМониторингаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеМониторингаЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СкрытВМониторинге</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/DataProcessors/МониторингЗаказов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПоказатьПараметры(Команда)
	ВидимостьПараметров(Не ПараметрыОткрыты);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПараметров(ВидимостьПараметров)
	Элементы.ГруппаПараметры.Видимость = ВидимостьПараметров;
	Элементы.ФормаПоказатьПараметры.Пометка = ВидимостьПараметров;
	ПараметрыОткрыты = ВидимостьПараметров;
КонецПроцедуры	

Процедура УстановитьНачальныеПараметры()
	Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Объект.ДатаМониторинга = ТекущаяДата();
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	УстановитьНачальныеПараметры();
КонецПроцедуры

Процедура УстановитьПараметрыЗапроса()	
	ДанныеМониторинга.Параметры.УстановитьЗначениеПараметра("СимволПереводаСтроки", Символы.ПС);
	ДанныеМониторинга.Параметры.УстановитьЗначениеПараметра("ДатаНач", НачалоДня(Объект.ДатаМониторинга));
	ДанныеМониторинга.Параметры.УстановитьЗначениеПараметра("ДатаКон", КонецДня(Объект.ДатаМониторинга));
	ДанныеМониторинга.Параметры.УстановитьЗначениеПараметра("МоментВремениОкончанияИнтервала", ТекущаяДата() + 60 * Объект.ГраницаМониторингаПоИнтервалуДоставкиЗаказа);
	ДанныеМониторинга.Параметры.УстановитьЗначениеПараметра("МоментВремениОкончанияИнтервалаБезДаты", Дата("00010101" + Формат(Час(ТекущаяДата()), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(Минута(ТекущаяДата()), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=") + Формат(Секунда(ТекущаяДата()), "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=")) + 60 * Объект.ГраницаМониторингаПоИнтервалуДоставкиЗаказа);
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПериодАвтообновленияСписка();
	УстановитьПараметрыЗапроса();
	ПодключитьОбработчикОжидания("АктуализацияПараметровЗапроса", "60");
КонецПроцедуры

&НаСервере
Процедура ГраницаМониторингаПоИнтервалуДоставкиЗаказаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	ОбновитьДанныеПоМониторингу();
	ЕстьНесохраненныеДанные = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГраницаМониторингаПоИнтервалуДоставкиЗаказаПриИзменении(Элемент)
	ГраницаМониторингаПоИнтервалуДоставкиЗаказаПриИзмененииНаСервере();
КонецПроцедуры

Процедура ОбновитьДанныеПоМониторингу()
	УстановитьНачальныеПараметры();
	УстановитьПараметрыЗапроса();
	Элементы.ДанныеМониторинга.Обновить();
КонецПроцедуры	

&НаКлиенте
Процедура АктуализацияПараметровЗапроса()
	Объект.ДатаМониторинга = ТекущаяДата();
	ОбновитьДанныеПоМониторингу();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	// Вставить содержимое обработчика.
	ОбновитьДанныеПоМониторингу();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтообновленияСпискаПриИзменении(Элемент)
	УстановитьПериодАвтообновленияСписка();
КонецПроцедуры

Процедура УстановитьПериодАвтообновленияСписка()
	//Если Объект.ПериодАвтообновленияСписка = 0 Тогда
		Элементы.ДанныеМониторинга.АвтоОбновление = Ложь;
	//Иначе	
	//	Элементы.ДанныеМониторинга.АвтоОбновление = Истина;
	//	Элементы.ДанныеМониторинга.ПериодАвтоОбновления = Объект.ПериодАвтообновленияСписка;
	//КонецеСли;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьВыборкуДанныхМониторинга(Заказ, ДатаДоставки)
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	МониторингЗаказовСрезПоследних.СкрытВМониторинге КАК СкрытВМониторинге,
	            |	МониторингЗаказовСрезПоследних.КомментарийПользователя КАК КомментарийПользователя
	            |ИЗ
	            |	РегистрСведений.ДанныеМониторингаЗаказов.СрезПоследних КАК МониторингЗаказовСрезПоследних
	            |ГДЕ
	            |	МониторингЗаказовСрезПоследних.Заказ = &Заказ
	            |	И МониторингЗаказовСрезПоследних.ДатаДоставки = &ДатаДоставки";
	Зап.УстановитьПараметр("Заказ", Заказ);
	Зап.УстановитьПараметр("ДатаДоставки", ДатаДоставки);
	Выб = Зап.Выполнить().Выбрать();
	Возврат Выб;
КонецФункции	

&НаСервере
Процедура СкрытьЗаказНаСервере(Заказ)
	// Вставить содержимое обработчика.
	Выб = ПолучитьВыборкуДанныхМониторинга(Заказ, НачалоДня(Объект.ДатаМониторинга));
	
	Если Выб.Следующий() Тогда
		СкрытВМониторинге = Выб.СкрытВМониторинге;
		КомментарийПользователя = Выб.КомментарийПользователя;
	Иначе
		СкрытВМониторинге = Ложь;
		КомментарийПользователя = "";
	КонецеСли;
	
	МоментВремени = ТекущаяДата();
	Наб = РегистрыСведений.ДанныеМониторингаЗаказов.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(МоментВремени);
	Наб.Отбор.Заказ.Установить(Заказ);
	
	Нов = Наб.Добавить();
	Нов.ДатаДоставки = НачалоДня(Объект.ДатаМониторинга);
	Нов.Заказ = Заказ;
	Нов.Период = МоментВремени;
	Нов.СкрытВМониторинге = Не СкрытВМониторинге;
	Нов.КомментарийПользователя = КомментарийПользователя;
	Нов.Пользователь = Объект.Пользователь;
	
	
	Наб.Записать();
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЗаказ(Команда)
	Если Элементы.ДанныеМониторинга.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецеСли;	
	СкрытьЗаказНаСервере(Элементы.ДанныеМониторинга.ТекущиеДанные.Заказ);
КонецПроцедуры

&НаСервере
Процедура КомментироватьНаСервере(Заказ, КомментарийПользователя)
	// Вставить содержимое обработчика.
	Выб = ПолучитьВыборкуДанныхМониторинга(Заказ, НачалоДня(Объект.ДатаМониторинга));
	
	Если Выб.Следующий() Тогда
		СкрытВМониторинге = Выб.СкрытВМониторинге;
	Иначе
		СкрытВМониторинге = Ложь;
	КонецеСли;
	
	МоментВремени = ТекущаяДата();
	Наб = РегистрыСведений.ДанныеМониторингаЗаказов.СоздатьНаборЗаписей();
	Наб.Отбор.Период.Установить(МоментВремени);
	Наб.Отбор.Заказ.Установить(Заказ);
	
	Нов = Наб.Добавить();
	Нов.ДатаДоставки = НачалоДня(Объект.ДатаМониторинга);
	Нов.Заказ = Заказ;
	Нов.Период = МоментВремени;
	Нов.СкрытВМониторинге = СкрытВМониторинге;
	Нов.КомментарийПользователя = КомментарийПользователя;
	Нов.Пользователь = Объект.Пользователь;
	
	
	Наб.Записать();
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Комментировать(Команда)
	Если Элементы.ДанныеМониторинга.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецеСли;
	КомментарийПользователя = "";
	ПоказатьВводЗначения(Новый ОписаниеОповещения("КомментироватьЗавершение", ЭтотОбъект, Новый Структура("КомментарийПользователя", КомментарийПользователя)), КомментарийПользователя, "Введите комментарий к заказу...", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));	
КонецПроцедуры

&НаКлиенте
Процедура КомментироватьЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	КомментарийПользователя = ?(Значение = Неопределено, ДополнительныеПараметры.КомментарийПользователя, Значение);
	
	
	Если (Значение <> Неопределено) Тогда
		КомментироватьНаСервере(Элементы.ДанныеМониторинга.ТекущиеДанные.Заказ, КомментарийПользователя);
	КонецеСли;
	
КонецПроцедуры
